In [17]:
import pandas as pd
import numpy as np

In [7]:
# Creating an empty Series
x = pd.Series()
print("Empty series Example: ",x)

Empty series Example:  Series([], dtype: float64)

C:\Users\Admin\AppData\Local\Temp\ipykernel_10420\1301372151.py:2: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  x = pd.Series()

In [8]:
# Series example
series1 = pd.Series([10,20,30,50])
print(series1)

0    10
1    20
2    30
3    50
dtype: int64

In [9]:
# Re-indexing the default index column
series2 = pd.Series([10,20,30,50], index = ['a','b','c','d'])
print(series2)

a    10
b    20
c    30
d    50
dtype: int64

In [14]:
# Accessing a Series Element
series2['b']

20

In [18]:
# Data manipulation with Series
print("Adding 5 to a Series: \n", series2 +5)
print("Filtering series with greater than 30: \n", series2[series2>30])
print("Square root of Series elements: \n", np.sqrt(series2))

Adding 5 to a Series:
 a    15
b    25
c    35
d    55
dtype: int64
Filtering series with greater than 30:
 d    50
dtype: int64
Square root of Series elements:
 a    3.162278
b    4.472136
c    5.477226
d    7.071068
dtype: float64

In [19]:
# A sample dictionary
data = {'abc':1,'def':2, 'ghi': 3}
print("Dictionary example: \n", data)
# Converting dictionary to series
pd.Series(data)

Dictionary example:
 {'abc': 1, 'def': 2, 'ghi': 3}

abc    1
def    2
ghi    3
dtype: int64

In [20]:
# Creating an empty dataframe
df = pd.DataFrame()
print("Dataframe example: \n", df)

Dataframe example:
 Empty DataFrame
Columns: []
Index: []

In [21]:
# A sample list containing name and age
data = [['Tom', 10], ['Harry', 12], ['Jim', 13]]
# Creating a dataframe form given list with colums names
df = pd.DataFrame(data,columns = ['Name', 'Age'])
df

    Name  Age
0    Tom   10
1  Harry   12
2    Jim   13

In [22]:
# Accessing a dataframe colums - first way
df['Name']

0      Tom
1    Harry
2      Jim
Name: Name, dtype: object

In [23]:
# Accessing a dataframe column - second way
df.Name

0      Tom
1    Harry
2      Jim
Name: Name, dtype: object

In [24]:
# Adding a column in existing dataframe
df['Year'] = 2008
df

    Name  Age  Year
0    Tom   10  2008
1  Harry   12  2008
2    Jim   13  2008

In [25]:
print("Original dataframe: \n",df)
del df['Year']
print("Dataframe after del: \n", df)
df.pop('Age')
print("Dataframe after pop: \n", df)
df

Original dataframe:
     Name  Age  Year
0    Tom   10  2008
1  Harry   12  2008
2    Jim   13  2008
Dataframe after del:
     Name  Age
0    Tom   10
1  Harry   12
2    Jim   13
Dataframe after pop:
     Name
0    Tom
1  Harry
2    Jim

    Name
0    Tom
1  Harry
2    Jim

In [27]:
# A sample dataframe containing company stock data 
data = pd.DataFrame({'price': [95,25,85,41],
                    'ticker':['AXP','CSCO','DIS','MSFT'],
                    'company': ['American Express', 'Cisco','Walt Disney','Microsoft']})
data

   price ticker           company
0     95    AXP  American Express
1     25   CSCO             Cisco
2     85    DIS       Walt Disney
3     41   MSFT         Microsoft

In [29]:
# Access the value that is at index 0, in column 'company using loc
print(data.loc[0]['company'])
# Access the value that is at index 0, in column 'company' using iloc
print(data.iloc[0][0])

American Express
95

In [31]:
# Inspecting to 5 rows of a dataframe
print("Top five data: \n", data.head())
# Inspecting below 5 rows of a dataframe
print("Below 5 data: \n", data.tail())

Top five data:
    price ticker           company
0     95    AXP  American Express
1     25   CSCO             Cisco
2     85    DIS       Walt Disney
3     41   MSFT         Microsoft
Below 5 data:
    price ticker           company
0     95    AXP  American Express
1     25   CSCO             Cisco
2     85    DIS       Walt Disney
3     41   MSFT         Microsoft

In [32]:
# Check data type of columns
data.dtypes

price       int64
ticker     object
company    object
dtype: object

In [33]:
# Descriptive statistics of the data
data.describe()

           price
count   4.000000
mean   61.500000
std    33.798422
min    25.000000
25%    37.000000
50%    63.000000
75%    87.500000
max    95.000000

In [34]:
# Information of the dataframe
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   price    4 non-null      int64
 1   ticker   4 non-null      object
 2   company  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [35]:
# A sample dataframe
df = pd.DataFrame(np.random.randn(5,3), index = ['a','c','e','f','h'],
                 columns = ['one','two','three'])
# Creating a data with missing values by reindexing
df2 = df.reindex(['a','b','c','d','e','f','g','h'])
df2

        one       two     three
a  2.375077 -1.391311  1.641474
b       NaN       NaN       NaN
c  1.459654 -1.526003 -0.348561
d       NaN       NaN       NaN
e  1.661281 -0.157537  1.389166
f -0.264496  0.171665 -1.900351
g       NaN       NaN       NaN
h -0.369732  0.032913  0.781963

In [36]:
# Checking missing values using isnull()
print(df2.isnull())
missing_values_count = df2.isnull().sum()
print("Count of missing values: \n", missing_values_count)

     one    two  three
a  False  False  False
b   True   True   True
c  False  False  False
d   True   True   True
e  False  False  False
f  False  False  False
g   True   True   True
h  False  False  False
Count of missing values:
 one      3
two      3
three    3
dtype: int64

In [37]:
# Remove all the rows that contain a missing value
df2 = df2.dropna()
print(df2)

        one       two     three
a  2.375077 -1.391311  1.641474
c  1.459654 -1.526003 -0.348561
e  1.661281 -0.157537  1.389166
f -0.264496  0.171665 -1.900351
h -0.369732  0.032913  0.781963

In [38]:
# Remove all colums with at least one missing value
columns_with_na_dropped = df.dropna(axis=1)
columns_with_na_dropped.head()

        one       two     three
a  2.375077 -1.391311  1.641474
c  1.459654 -1.526003 -0.348561
e  1.661281 -0.157537  1.389166
f -0.264496  0.171665 -1.900351
h -0.369732  0.032913  0.781963

In [39]:
# Filling NaN with zeros
df3 =df2.fillna(0)
df3

        one       two     three
a  2.375077 -1.391311  1.641474
c  1.459654 -1.526003 -0.348561
e  1.661281 -0.157537  1.389166
f -0.264496  0.171665 -1.900351
h -0.369732  0.032913  0.781963

In [40]:
# Replace all NA's the values that comes directly after it in the same column
# Then replace all the remaining NA's with 0
df4 = df2.fillna(method = 'bfill', axis =0).fillna(0)
df4

        one       two     three
a  2.375077 -1.391311  1.641474
c  1.459654 -1.526003 -0.348561
e  1.661281 -0.157537  1.389166
f -0.264496  0.171665 -1.900351
h -0.369732  0.032913  0.781963